In [1]:
# sql 관련 라이브러리 불러오기
from sqlalchemy.engine import create_engine
import sqlite3
from pandas.io import sql
import subprocess
%load_ext sql

In [2]:
%sql sqlite:///커머스.db

# 숫자함수

In [6]:
# ROUND
# 반올림
# 소수점 첫째자리는 0
%sql select round(100.56789,0)

 * sqlite:///커머스.db
Done.

[(101.0,)]

In [7]:
%sql select round(100.56789,3)

 * sqlite:///커머스.db
Done.

[(100.568,)]

In [9]:
# TRUNC
# 내림
# 소수점 첫째자리는 .0

# %sql select trunc(100.56789,3); # (sqlite3.OperationalError) no such function: trunc

 * sqlite:///커머스.db
(sqlite3.OperationalError) no such function: trunc
[SQL: select trunc(100.56789,3);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [5]:
%sql select * from 상품;

 * sqlite:///커머스.db
Done.

[(0, 1, '한정판 노트북 스티커', 10, 1600000, 22, '황금으로 만들어진 고급스러운 디자인의 100주년 한정판 스티커', 101),
 (1, 2, '위니브 프렌즈 노트북 파우치', 10, 48500, 71, '귀여운 위니브 프렌즈 캐릭터가 포인트인 노트북 파우치', 101),
 (2, 3, 'LED 전구', 5, 34900, 73, '화이트 세라믹으로 고급스러운 분위기 조성하는 테이블 램프', 102),
 (3, 4, '위니브 AI 볼펜', 9, 34900, 35, '최신 인공지능 기술이 적용된 드를 짜주는 스마트 볼펜', 101),
 (4, 5, '블루투스 스피커', 9, 54800, 45, '고품질 음향과 블루투스 연결이 가능한 스피커', 103),
 (5, 6, '스마트폰 XZ Pro', 9, 1420000, 83, '고성능 카메라와 최신 기술을 탑재한 스마트폰', 103),
 (6, 7, '내열 주방 프라이팬', 4, 39900, 26, '내열 기능이 뛰어난 주방 필수 아이템', 105),
 (7, 8, '모던 디자인 베드룸등', 6, 42000, 40, '모던한 디자인으로 공간을 화려하게 밝히는 베드룸등', 102),
 (8, 9, '전기 그릴', 4, 149000, 8, '편리한 조작과 깔끔한 정화능력을 갖춘 전기 그릴', 105),
 (9, 10, '캔들 홈 인테리어', 6, 19900, 52, '편안한 분위기를 연출하는 홈 인테리어 캔들', 107),
 (10, 11, '스마트 헬스 밴드', 11, 69900, 56, '운동량 및 심박수 등을 체크하는 스마트 헬스 밴드', 108),
 (11, 12, '퓨어소프트 화장지', 5, 5900, 105, '부드럽고 흡수력이 뛰어난 퓨어소프트 화장지', 106),
 (12, 13, '요가매트 Pro', 7, 29800, 43, '고밀도 폼으로 만든 편안한 요가매트', 104),
 (13, 14, '트레킹용 백팩', 7, 65000, 72, '트레킹이나 등산에 최적화된 튼튼한 백팩', 109),
 (14, 15, '4K 액션캠', 9, 129000, 20, '고화질 영상 촬영이 가능한 4K 액션캠', 109),
 (15, 16, '멀티비타민 건강보조제', 11, 26000, 132, '다양한 비타민 및 미네랄이 포함된 멀티비타민', 108),
 (16, 17, '간편한 접이식 옷걸이', 5, 9500, 38, '간편하게 사용 가능한 접이식 옷걸이', 106),
 (17, 18, '캐주얼 코튼 티셔츠', 1, 29500, 87, '편안한 일상 코디에 어울리는 캐주얼 티셔츠', 110),
 (18, 19, '여름용 린넨 드레스', 1, 34500, 21, '시원하고 가볍게 입을 수 있는 여름용 린넨 드레스', 110),
 (19, 20, '에어프라이어', 8, 129000, 95, '간편한 조리 및 건강한 음식 조리 가능한 에어프라이어', 112),
 (20, 21, '경량 스포츠 가방', 7, 45500, 67, '경량 디자인으로 휴양지 여행에 최적화된 가방', 109),
 (21, 22, '스마트 전기포트', 8, 69900, 24, '스마트 기능이 탑재된 빠른 전기포트', 112),
 (22, 23, '프리미엄 초콜릿', 3, 15500, 147, '고급 재료로 만든 프리미엄 초콜릿', 113),
 (23, 24, '스타일러 셔츠', 1, 39900, 52, '편안한 일상 코디에 어울리는 스마트 셔츠', 110),
 (24, 25, '기계식 키보드 K Elite', 9, 119000, 45, '게이밍에 특화된 디자인과 고성능 기계식 키보드', 114),
 (25, 26, '유기농 곡물 시리얼', 3, 19500, 88, '유기농 재료로 만든 건강한 곡물 시리얼', 115),
 (26, 27, '페이셜 마사지 롤러', 2, 18900, 29, '얼굴 근육을 튼튼하게 해주는 페이셜 마사지 롤러', 116),
 (27, 28, '캠핑용 2인 텐트', 7, 79800, 39, '2인용으로 간편하게 캠핑을 즐길 수 있는 텐트', 111),
 (28, 29, '게이밍 마우스 G Pro', 9, 79900, 63, '게이밍에 최적화된 고성능 마우스', 114),
 (29, 30, '프리미엄 커피 머신', 8, 189000, 53, '프리미엄 원두를 사용한 고품질 커피를 추출하는 머신', 112)]

In [10]:
# MOD
# 나머지
# %sql select mod(10,3); # (sqlite3.OperationalError) no such function: mod

 * sqlite:///커머스.db
(sqlite3.OperationalError) no such function: mod
[SQL: select mod(10,3);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [13]:
# POWER
# 제곱
# %sql select power(10,3) # (sqlite3.OperationalError) no such function: power

 * sqlite:///커머스.db
(sqlite3.OperationalError) no such function: power
[SQL: select power(10,3)]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [14]:
# SQRT
# 제곱근
# %sql select sqrt(10) # (sqlite3.OperationalError) no such function: sqrt

 * sqlite:///커머스.db
(sqlite3.OperationalError) no such function: sqrt
[SQL: select sqrt(10)]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# 문자열 함수

In [ ]:
# SUBSTR
# 문자열 일부

In [15]:
%sql select substr('hello world', 3, 5)

 * sqlite:///커머스.db
Done.

[('llo w',)]

In [ ]:
# LEFT
# 문자열 왼쪽 기준 슬라이싱

In [17]:
# %sql select left('064-000-0000',3); # (sqlite3.OperationalError) near "(": syntax error

 * sqlite:///커머스.db
(sqlite3.OperationalError) near "(": syntax error
[SQL: select left('064-000-0000',3);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
# RIGHT
# 문자열 오른쪽 기준 슬라이싱

In [18]:
%sql select right('064-000-1234',4); # (sqlite3.OperationalError) near "(": syntax error

 * sqlite:///커머스.db
(sqlite3.OperationalError) near "(": syntax error
[SQL: select right('064-000-1234',4);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
# CONCAT
# 여러 문자열을 하나로 연결

In [28]:
# %sql select concat('paul', '-', 'lab') # (sqlite3.OperationalError) no such function: concat

 * sqlite:///커머스.db
(sqlite3.OperationalError) no such function: concat
[SQL: select concat('paul', '-' , 'lab' )]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
# || => 문자열 합치기

In [23]:
%sql select 배송주소, 총주문금액 from 주문;

 * sqlite:///커머스.db
Done.

[('서울특별시 강남구 한류로 123', 1697000),
 ('경상남도 거제시 바닷소리로 1616', 69900),
 ('광주광역시 서구 무궁화로 202', 244300),
 ('강원도 강릉시 동해대로 707', 65000),
 ('경상남도 김해시 해바라기로 444', 183500),
 ('세종특별자치시 조치원읍 웃음가득로 2626', 78000),
 ('제주특별자치도 서귀포시 오름산로 456', 88500),
 ('경기도 수원시 화성로 2727', 79900),
 ('경기도 파주시 DMZ로 777', 34500),
 ('세종특별자치시 조치원읍 한글로 505', 37800),
 ('강원도 속초시 동명로 666', 129000),
 ('광주광역시 서구 무궁화로 202', 237200),
 ('제주특별자치도 제주시 오름로 555', 1559800),
 ('세종특별자치시 금남면 갈매로 505', 39000),
 ('전라북도 전주시 덕진구 동별로 111', 69900),
 ('경상남도 창원시 창원대로 444', 189000),
 ('울산광역시 남구 석유로 404', 109600),
 ('제주특별자치도 서귀포시 하늘길로 1818', 119000),
 ('경상북도 경주시 문화역서울로 333', 153200),
 ('제주특별자치도 제주시 바닷길 111', 29800),
 ('인천광역시 인하로 888', 79800),
 ('충청남도 아산시 배반로 909', 308600),
 ('강원도 강릉시 강릉행복로 2828', 77500),
 ('부산광역시 해운대구 해맞이로 456', 129000)]

In [24]:
%sql select substr(배송주소,1,2)||substr(배송주소,3,2)  , sum(총주문금액) from 주문 group by substr(배송주소,1,2)||substr(배송주소,3,2);

 * sqlite:///커머스.db
Done.

[('강원도 ', 271500),
 ('경기도 ', 114400),
 ('경상남도', 442400),
 ('경상북도', 153200),
 ('광주광역', 481500),
 ('부산광역', 129000),
 ('서울특별', 1697000),
 ('세종특별', 154800),
 ('울산광역', 109600),
 ('인천광역', 79800),
 ('전라북도', 69900),
 ('제주특별', 1797100),
 ('충청남도', 308600)]

In [27]:
%sql select substr(배송주소,3,2)||substr(배송주소,1,4)  , sum(총주문금액) from 주문 group by substr(배송주소,3,2)||substr(배송주소,1,4);

 * sqlite:///커머스.db
Done.

[('광역광주광역', 481500),
 ('광역부산광역', 129000),
 ('광역울산광역', 109600),
 ('광역인천광역', 79800),
 ('남도경상남도', 442400),
 ('남도충청남도', 308600),
 ('도 강원도 ', 271500),
 ('도 경기도 ', 114400),
 ('북도경상북도', 153200),
 ('북도전라북도', 69900),
 ('특별서울특별', 1697000),
 ('특별세종특별', 154800),
 ('특별제주특별', 1797100)]

In [ ]:
# LOWER
# 소문자로 변경

In [29]:
%sql select lower('Abc');

 * sqlite:///커머스.db
Done.

[('abc',)]

In [ ]:
# UPPER
# 대문자로 변경

In [30]:
%sql select upper('Abc');

 * sqlite:///커머스.db
Done.

[('ABC',)]

In [ ]:
# INITCAP
# 앞에 문자만 대문자로 변경

In [33]:
# %sql select initcap('abcde'); # (sqlite3.OperationalError) no such function: initcap

 * sqlite:///커머스.db
(sqlite3.OperationalError) no such function: initcap
[SQL: select initcap('abcde'); # (sqlite3.OperationalError) no such function: initcap]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
# REPLACE
# 대상값 교체

In [34]:
%sql select replace('hello world', 'world', 'sql');

 * sqlite:///커머스.db
Done.

[('hello sql',)]

In [35]:
# LENGTH
# 길이
%sql select length('hello world');

 * sqlite:///커머스.db
Done.

[(11,)]

In [36]:
# POSITION
# 문자열 위치
# 인덱스는 1부터
# 못 찾으면 0 반환

 * sqlite:///커머스.db
(sqlite3.OperationalError) no such table: abcdef
[SQL: select POSITION('b' IN 'abcdef' );]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [41]:
# %sql select position('전구' in 상품명) from 상품; # (sqlite3.OperationalError) no such function: position

 * sqlite:///커머스.db
(sqlite3.OperationalError) no such function: position
[SQL: select position('전구' in 상품) from 상품;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
# coalesce
# 컬럼에 NULL값이 있으면 다른 값 채워넣음

In [44]:
# %sql select coalesce(name, '담당자 지정 안됨') from `weniv.weniv_event`

In [45]:
# ASCII
# 아스키코드 번호 반환
# %sql select ascii('A'); # (sqlite3.OperationalError) no such function: ascii

 * sqlite:///커머스.db
(sqlite3.OperationalError) no such function: ascii
[SQL: select ascii('A');]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# 형변환

In [ ]:
# CAST(데이터 AS 타입명)

In [46]:
# 문자열 -> 숫자로 바꾸는거
# 문자열 -> 자연수(INTEGER)
# 문자열 -> FLOAT

%sql select CAST('123' AS INT);

 * sqlite:///커머스.db
Done.

[(123,)]

In [47]:
%sql select '123' + '123' # 에러;

 * sqlite:///커머스.db
(sqlite3.OperationalError) unrecognized token: "#"
[SQL: select '123' + '123' # 에러;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [48]:
%sql select CAST('123' AS INT) + CAST('123' AS INT);

 * sqlite:///커머스.db
Done.

[(246,)]

In [49]:
%sql select CAST('123.123' AS FLOAT);

 * sqlite:///커머스.db
Done.

[(123.123,)]

In [50]:
%sql select CAST('123' AS NUMERIC);

 * sqlite:///커머스.db
Done.

[(123,)]

In [51]:
%sql select CAST('123.123' AS NUMERIC);

 * sqlite:///커머스.db
Done.

[(123.123,)]

In [ ]:
# 데이터::타입명

In [55]:
# %sql select '123'::INT; # (sqlite3.OperationalError) unrecognized token: ":"

In [56]:
# %sql select '123.123'::NUMERIC; # (sqlite3.OperationalError) unrecognized token: ":"

In [57]:
# %sql select '123.123'::TEXT; # (sqlite3.OperationalError) unrecognized token: ":"

In [59]:
# 숫자(INTEGER) -> 문자
# 숫자(FLOAT) -> 문자
# true, false -> 문자
%sql select CAST(123 AS TEXT)
%sql select CAST(123.123 AS TEXT)
%sql select CAST(true AS TEXT)
%sql select CAST(false AS TEXT)
%sql select CAST(NULL AS TEXT)

 * sqlite:///커머스.db
Done.
 * sqlite:///커머스.db
Done.
 * sqlite:///커머스.db
Done.
 * sqlite:///커머스.db
Done.
 * sqlite:///커머스.db
Done.

[(None,)]

In [ ]:
# %sql select 123::TEXT;
# %sql select 123.123::TEXT;
# %sql select true::TEXT;

In [61]:
# 날짜 타입
# 1) DATE
# 문자열 -> DATE
# 2) DATETIME
# 문자열 -> DATETIME
%sql select DATE('2011-12-01 11:12:34')

 * sqlite:///커머스.db
Done.
 * sqlite:///커머스.db
(sqlite3.OperationalError) unrecognized token: ":"
[SQL: SELECT '2011-12-01 11:12:34' ::DATE;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)
 * sqlite:///커머스.db
(sqlite3.OperationalError) unrecognized token: ":"
[SQL: SELECT '2011-12-01 11:12:34' ::TIME;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)
 * sqlite:///커머스.db
(sqlite3.OperationalError) unrecognized token: ":"
[SQL: SELECT '2011-12-01 11:12:34' ::TIMESTAMP;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
# %sql SELECT '2011-12-01 11:12:34'::DATE;
# %sql SELECT '2011-12-01 11:12:34'::TIME;
# %sql SELECT '2011-12-01 11:12:34'::TIMESTAMP;

# 날짜

In [62]:
# 현재 날짜를 나타냅니다.
%sql SELECT DATE();

 * sqlite:///커머스.db
Done.

[('2024-03-06',)]

In [63]:
# 사용자의 현재 시간을 나타냅니다.
%sql SELECT TIME();

 * sqlite:///커머스.db
Done.

[('14:49:31',)]

In [64]:
# 현재의 날짜와 시간을 한꺼번에 나타냅니다.
%sql SELECT DATETIME();

 * sqlite:///커머스.db
Done.

[('2024-03-06 14:49:36',)]

In [65]:
# (날짜 및 시간 함수 등)DATE, TIME 값을 포맷에 맞춰서 반환합니다.
# -- strftime : 포맷 지정 (format, timestring, modifier)
# -- DATE, TIME 값을 포맷에 맞추어 반환합니다.
# 국가별 FOMAT이 달라서 필요
# %sql SELECT STAFTIME('%Y-%m-%d %H:%M:%S', 'now');
# %sql SELECT STAFTIME('%Y#%m#%d %H@%M@%S', 'now');

 * sqlite:///커머스.db
(sqlite3.OperationalError) no such function: STAFTIME
[SQL: SELECT STAFTIME('%Y-%m-%d %H:%M:%S', 'now' );]
(Background on this error at: https://sqlalche.me/e/20/e3q8)
 * sqlite:///커머스.db
(sqlite3.OperationalError) no such function: STAFTIME
[SQL: SELECT STAFTIME('%Y#%m#%d %H@%M@%S', 'now' );]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
# 한정자 활용하기
# -- 현지시간 기준으로 현재 달의 마지막 날짜
# SELECT DATE('now', 'start of month', '+1 month', '-1 day', 'localtime');
# -- 현재 기준 얼마나 가입시간이 지났는지? 
# --(한국)3월 6일 - (미국)3월 5일 9시간정도

In [ ]:
# https://school.programmers.co.kr/learn/courses/30/lessons/132201
# 12세 이하인 여자 환자 목록 출력하기

In [ ]:
select PT_NAME, PT_NO, GEND_CD, AGE, IFNULL(TLNO, 
                                           'NONE') from PATIENT where (GEND_CD = 'W') and (AGE <= 12) order by AGE desc, PT_NAME asc;

In [ ]:
CASE WHEN 
    조건 
THEN 
    참일경우실행구문 
ELSE 
    거짓일경우실행구문 
END 
as 새로운_변수명
-- 재고 10개 이하인 경우 최상
-- 재고 10~30개 이하인 경우 상
-- 재고 30~50개 이하인 경우 중
-- 재고 50개 이상이면 하

In [ ]:
'''
select 재고,
    case when 재고 <= 10 then '최상'
         when 재고 <= 30 then '상'
         when 재고 <= 50 then '중'
         else '하' end as '재고분류'
from 상품
'''

In [69]:
%sql select 재고, case when 재고 <= 10 then '최상' when 재고 <= 30 then '상' when 재고 <= 50 then '중' else '하' end as '재고분류' from 상품;

 * sqlite:///커머스.db
Done.

[(22, '상'),
 (71, '하'),
 (73, '하'),
 (35, '중'),
 (45, '중'),
 (83, '하'),
 (26, '상'),
 (40, '중'),
 (8, '최상'),
 (52, '하'),
 (56, '하'),
 (105, '하'),
 (43, '중'),
 (72, '하'),
 (20, '상'),
 (132, '하'),
 (38, '중'),
 (87, '하'),
 (21, '상'),
 (95, '하'),
 (67, '하'),
 (24, '상'),
 (147, '하'),
 (52, '하'),
 (45, '중'),
 (88, '하'),
 (29, '상'),
 (39, '중'),
 (63, '하'),
 (53, '하')]

In [ ]:
-- 상품카테고리ID 5이하이면 인기상품 / 5~7이면 상품 / 8이상 하품 - 카테고리정리(새로운 컬럼)
select case WHEN 조건
    THEN 조건1이 맞을때
    then 조건2가 맞을때
    ELSE 조건1,2가 모두 틀릴때
    END as 새로운컬럼명

In [71]:
'''
select
    case when 카테고리ID <= 5 then '인기상품'
	     when 카테고리ID <= 7 then '상품'
		 else '상품' end as '카테고리정리'
from 상품;
'''

SyntaxError: invalid syntax (1589845040.py, line 2)

In [ ]:
# -- 상품카테고리ID 5이하이면 인기상품 / 5~7이면 상품 / 8이상 하품 - 카테고리정리(새로운 컬럼)
'''
select case 
    WHEN 카테고리ID <= 5 THEN '인기상품'
    when 카테고리ID <= 7 then '상품'
    ELSE '하품'
    END as 카테고리정리, count(*)
from 상품
group by 카테고리정리
'''

In [ ]:
# https://school.programmers.co.kr/learn/courses/30/lessons/59409
# 중성화 여부 파악하기

In [ ]:
'''
# 풀이 1
SELECT ANIMAL_ID, NAME, CASE 
    WHEN (SEX_UPON_INTAKE LIKE 'Neutered%') OR (SEX_UPON_INTAKE LIKE 'Spayed%') THEN 'O'
    ELSE 'X'
    END AS 중성화
FROM ANIMAL_INS
ORDER BY ANIMAL_ID;

# 풀이 2
SELECT ANIMAL_ID, NAME,
    case 
    -- 조건1. Intact가 들어가면 'X'
    when SEX_UPON_INTAKE = 'Intact Male' 
    then 'X'
    when SEX_UPON_INTAKE = 'Intact Female' 
    then 'X'
    -- 조건1이 아니면
    else 'O'
    end as 중성화
from ANIMAL_INS

'''

In [ ]:
# https://school.programmers.co.kr/learn/courses/30/lessons/131113?language=mysql
# 조건별로 분류하여 주문상태 출력하기

In [ ]:
'''
# 풀이 1
SELECT ORDER_ID, PRODUCT_ID, LEFT(OUT_DATE, 10), CASE
    WHEN OUT_DATE IS NULL THEN '출고미정'
    WHEN OUT_DATE <= '2022-05-01' THEN '출고완료'
    ELSE '출고대기'  
    END AS '출고여부'
FROM FOOD_ORDER
ORDER BY ORDER_ID ASC;

# 풀이 2
SELECT ORDER_ID, PRODUCT_ID, SUBSTRING(OUT_DATE, 1,10) AS OUT_DATE, CASE
    WHEN OUT_DATE IS NULL THEN '출고미정'
    WHEN OUT_DATE <= '2022-05-01' THEN '출고완료'
    ELSE '출고대기'  
    END AS '출고여부'
FROM FOOD_ORDER
ORDER BY ORDER_ID ASC;


# 풀이 3
SELECT ORDER_ID, PRODUCT_ID, DATE_FORMAT(OUT_DATE, '%Y-%m-%d') AS OUT_DATE, CASE 
    WHEN OUT_DATE IS NULL THEN '출고미정'
    WHEN OUT_DATE <= '2022-05-01' THEN '출고완료'
    ELSE '출고대기'
    END AS 출고여부
FROM FOOD_ORDER
ORDER BY ORDER_ID ASC;
'''

# join

In [ ]:

--주문 테이블에 있는 ID와 주문상세 있는 ID가 이름이 똑같기 때문에 SQL은 헷갈려함!
select 주문.주문ID, 주문상세.주문ID
--테이블 세팅
from  주문 -- 1. 원래 테이블 / 기준이 되는 테이블
inner join -- 2. join하는 방법
주문상세 -- 3. 붙일 테이블
on 주문.주문ID=주문상세.주문ID -- 4. 같은 Key값에 대해서 설정

In [ ]:
'''
select *
from 
(select 주문ID,고객ID,주문날짜 from 주문 where 주문ID in (1001,1002,1003,1004)) a
full outer join
(select 주문ID,단가
 from 주문상세 where 주문ID in (1001,1002,1003,1005)) b
on a.주문ID=b.주문ID
'''

In [ ]:
# https://school.programmers.co.kr/learn/courses/30/lessons/131533
# 상품 별 오프라인 매출 구하기
'''
# 풀이 1
SELECT PRODUCT.PRODUCT_CODE AS PRODUCT_CODE, SUM(PRODUCT.PRICE * OFFLINE_SALE.SALES_AMOUNT) AS SALES 
FROM PRODUCT
INNER JOIN OFFLINE_SALE
ON PRODUCT.PRODUCT_ID = OFFLINE_SALE.PRODUCT_ID
GROUP BY PRODUCT_CODE
ORDER BY SALES DESC, PRODUCT_CODE ASC;

# 풀이 2
SELECT A.PRODUCT_CODE AS PRODUCT_CODE, SUM(A.PRICE * B.SALES_AMOUNT) AS SALES 
FROM PRODUCT A
INNER JOIN OFFLINE_SALE B
ON A.PRODUCT_ID = B.PRODUCT_ID
GROUP BY A.PRODUCT_CODE
ORDER BY SALES DESC, A.PRODUCT_CODE ASC;
'''